app/views/families/_family.html.erb

    <strong>Created at:</strong>
    <%= family.created_at %>
---
INSERT INTO "families" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "prueba2"], ["description", "prueba2"], ["created_at", "2024-07-28 23:01:03.568830"], ["updated_at", "2024-07-28 23:01:03.568830"]]