app/controllers/families_controller.rb

  def index
    @search = Family.all.search do
---
SELECT "families".* FROM "families"

  def create
    @family = Family.new(family_params)

    respond_to do |format|
      if @family.save
---
INSERT INTO "families" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "buenas"], ["description", "hola"], ["created_at", "2024-07-28 19:55:13.007003"], ["updated_at", "2024-07-28 19:55:13.007003"]]

  def update_inline
    if @family.update(family_params)
---
UPDATE "families" SET "name" = $1, "updated_at" = $2 WHERE "families"."id" = $3  [["name", "1000. CHAPA PERFILADAaaa"], ["updated_at", "2024-07-21 22:47:15.726945"], ["id", 3]]

  def destroy
    @family.destroy!
---
DELETE FROM "families" WHERE "families"."id" = $1  [["id", 4]]

    def set_family
      @family = Family.find(params[:id])
---
SELECT "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]